# Первое и последнее вхождение.
# На вход программе подается строка текста. Если в этой строке буква «f» встречается только один раз,
# выведите её индекс. Если она встречается два и более раз,
# выведите индекс её первого и последнего вхождения на одной строке, разделенных символом пробела.
# Если буква «f» в данной строке не встречается, следует вывести «NO».
#
# Формат входных данных
# На вход программе подается строка текста.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.

row = input()
if row.count('f') == 1:
    print(row.find('f'))
if row.count('f') >= 2:
    print(row.find('f'), row.rfind('f'))
if row.count('f') == 0:
    print('NO')







