#  Словарь синонимов.
# Вам дан словарь, состоящий из пар слов-синонимов. Повторяющихся слов в словаре нет.
# Напишите программу, которая для одного данного слова определяет его синоним.
#
# Формат входных данных:
# На вход программе подается количество пар синонимов n. Далее следует n строк,
# каждая строка содержит два слова-синонима.
# После этого следует одно слово, синоним которого надо найти.
#
# Формат выходных данных:
# Программа должна вывести одно слово, синоним введенного.
#
# Примечание 1. Гарантируется, что синоним введенного слова существует в словаре.
#
# Примечание 2. Все слова в словаре начинаются с заглавной буквы.

final_dict = {}

for _ in range(int(input())):
    key, value = input().split()
    final_dict[key] = value
    final_dict[value] = key

print(final_dict[input()])



# words = {}
# for _ in range(int(input())):
#     a, b = input().split()
#     words[a], words[b] = b, a
# print(words[input()])

