# Разбиение на чанки 🌶️
# На вход программе подаются две строки, на одной символы,
# на другой число n. Из первой строки формируется список.
#
# Реализуйте функцию chunked(), которая принимает на вход список и число,
# задающее размер чанка (куска), а возвращает список из чанков указанной длины.
#
# Формат входных данных
# На вход программе подается строка текста, содержащая символы,
# отделенные символом пробела и число n на отдельной строке.
#
# Формат выходных данных
# Программа должна вывести указанный вложенный список.
#
# Примечание. Не забудьте вызвать функцию chunked(), чтобы вывести результат 😀.


def chanked(row, n):

    res_list = []
    temp_list = []
    for i in row:
        temp_list.append(i)
        if len(temp_list) == n:
            res_list.append(temp_list)
            temp_list = []
    if len(row) < n:
        res_list = [row]
    elif len(row) % n != 0:
        res_list.extend([[row[-1]]])
    return res_list

row = input().split()
n = int(input())
print(chanked(row, n))


