# Урок биологии.
# Даны по 10-балльной шкале оценки по биологии трех учеников. Напишите программу,
# которая выводит множество оценок, не встречающихся ни у одного из трех учеников.
#
# Формат входных данных:
# На вход программе подаются оценки трех учеников, разделенные символом пробела
# (оценки каждого ученика на отдельной строке).
#
# Формат выходных данных:
# Программа должна вывести множество оценок в порядке возрастания на одной строке,
# разделенных пробелами, в соответствии с условием задачи.
#
# Примечание. Оценка ученика находится в диапазоне от 0 до 10 включительно.

s1 = set(int(i) for i in input().split())
s2 = set(int(i) for i in input().split())
s3 = set(int(i) for i in input().split())

s4 = set(range(11))

print(*sorted(s4 - s1 - s2 - s3))
